name = '张三'
age = 18
nickname = '法外狂徒'

# 要求输出-->姓名: 张三, 年龄: 18, 外号: 法外狂徒
# # 数字与字符串之间不能相加, 可以把数字转化成字符串
print('姓名:' + name + ', 年龄: ' + str(age) + ', 外号: ' + nickname)

print('--------------------- f 占位符-------------------------')
# f 直接带字符串里面插入变量
print(f'姓名: {name}, 年龄: {age}, 外号: {nickname}')

print('--------------------- format 占位符-------------------------')
# 一个都不能少
print('姓名: {}, 年龄: {}, 外号: {}'.format(name, age, nickname))

print('--------------------- %s 占位符-------------------------')
# 一个都不能少
print('姓名: %s, 年龄: %d, 外号: %s' %(name, age, nickname))
print('姓名: %s' % name)


"""要求大家至少掌握一种"""